<!-- $Id: advantages.html,v 1.1.1.1 2004-06-29 14:10:45 dale Exp $ -->
{[%hh_hdr_de:PhoA: Funktionen und Vorteile]}

<p align=justify>Die Vorteile, die <b>PhoA</b> beim Arbeiten mit Fotos, Grafiken und Zeichnungen bietet, sind offensichtlich:
<ul>
  <li>Das Programm bedarf keinerlei Installation und besteht (<i>zur Zeit</i>) ausschlie&szlig;lich aus der Programmdatei <b>phoa.exe</b>. Was bedeutet das? Das Bedeutet, dass es gemeinsam mit den erstellten Fotoalbumdateien (<b>*.phoa</b>)  kopiert und weitergegeben werden kann. Durch das Erstellen einer CD-R mit einer entsprechenden <b>autorun.inf</b>-Datei im Hauptverzeichnis k&ouml;nnen die Fotoalben auf jedem PC pr&auml;sentiert werden, und zwar durch einfaches Einlegen der CD (auf PCs mit eingeschalteter Autorun-Funktion). Das Programm gibt nicht einmal eine Fehlermeldung aus, wenn es die <b>phoa.chm</b>-Hilfedatei nicht findet.</li>
  <li>Mit dem Programm k&ouml;nnen Kataloge (<i>Fotoalbums</i>) erstellt werden, die ganz unterschiedliche Bilder enthalten. Die Bilder werden in Gruppen &auml;hnlich den Ordnern im Windows Explorer angeordnet. Die Bilder k&ouml;nnen in beinahe jedem Rasterformat vorliegen, einige Vektorformate werden auch unterst&uuml;tzt. N&auml;here Details zu den unterst&uuml;tzten Dateiformaten finden Sie <a href="file-formats.html">hier</a>.</li>
  <li>Jedes Bild kann Angaben zu Datum, Ort, Filmnummer und -name, Framenummer, Schl&uuml;sselw&ouml;rter, Beschreibung, Autor usw. enthalten. Ein <i>Thumbnail</i> - eine verkleinerte Ansicht eines Bildes - wird automatisch generiert (einige implementierte <a href="theory-resampling.html">Resampling</a>-Algorithmen). Die Abmessungen der Thumbnails k&ouml;nnen in den  <a href="intf-album-props.html">Eigenschaften Fotoalbum</a> festgelegt werden, die Thumbnails selbst werden in der Fotoalbumdatei abgespeichert; dies erlaubt das nahezu verz&ouml;gerungsfreie &Ouml;ffnen und Anzeigen des Fotoalbums. Die Thumbnails werden mit dem JPEG-Verfahren komprimiert und k&ouml;nnen w&auml;hrend des Anzeigemodus im Cachespeicher zwischengespeichert werden.</li>
  <li><b>PhoA</b> erlaubt eine augenblickliche <a href="intf-search.html">Suche</a> im Fotoalbum nach Bilddateinamen, Datum, Ort, Schl&uuml;sselw&ouml;rter, Beschreibungstext usw.; die Suchergebnisse werden als eine eigene Gruppe angezeigt und k&ouml;nnen den Bildern einer beliebigen anderen Gruppe zugeordnet werden.</li>
  <li>Das Fotoalbum enth&auml;lt relative Pfade zu den Bilddateien: Dadurch kann das Fotoalbum beliebig kopiert oder verschoben werden, wenn nur die urspr&uuml;ngliche Beziehung zwischen dem Fotoalbum und den Bildern erhalten bleibt. Wenn jedoch das Fotoalbum auf einem anderen Laufwerk oder einem Netzwerkserver angelegt wird (bzw. umgekehrt die Bilddateien sich sich auf einem Netzwerkserver und das Fotoalbum auf der lokalen Festplatte befinden), werden im Fotoalbum absolute Pfade angelegt und der Speicherort des Fotoalbums ist g&auml;nzlich unabh&auml;ngig vom Speicherort <i>dieser</i> Bilddateien.</li>
  <li>Eine Option erlaubt das Anzeigen von Tooltips im Browsermodus. Auch der Inhalt der Tooltips ist <a href="setup-browse-mode.html">anpassbar</a>.</li>
  <li><b>PhoA</b> besitzt eine <a href="intf-sort-pics.html">Sortierfunktion</a> f&uuml;r die Bilder der ausgew&auml;hlten Gruppe oder auch des gesamten Fotoalbums. Sortierkriterien k&ouml;nnen beinahe alle verf&uuml;gbaren Daten sein, eine beliebige Anzahl von Sortierkriterien kann festgelegt werden; das Programm beh&auml;lt die letzte Sortierung bei.</li>
  <li>Das Programm beherrscht <a href="intf-browse-mode-views.html"><i>Ansichten</i></a>: eine neuartige Technologie f&uuml;r den Browsermodus. Dadurch k&ouml;nnen mit geringstem Aufwand Unmengen von Bildern in neue Ordner/Gruppen klassifiziert werden. Einzige Voraussetzung daf&uuml;r ist das ordnungsgem&auml;&szlig;e Ausf&uuml;llen der Bildeigenschaften. Diese Eigenschaften dienen dem Zuordnen der Bilder zu neuen Ordnern/Gruppen. M&ouml;gliche Zuordnungsbedingungen sind: nach dem Pfadnamen der Bilddatei, nach Datum und Zeit (in verschiedener Anordnung), nach Ort, nach Schl&uuml;sselw&ouml;rtern, usw. Die Gruppen k&ouml;nnen hierarchisch aufgebaut werden, d.h. eine Zuordnungsbedingung nach der anderen definieren, die Anzahl der hierarchischen Gruppen ist eine Frage des &Uuml;berblicks. Das Resultat der Zuordnung (Baumansicht mit den enstprechenden Bildern) kann sehr leicht <a href="intf-sel-phoa-group.html">in eine beliebige Gruppe des Fotoalbums integriert</a>, und danach jeweils beliebig bearbeitet werden.</li>
  <li><b>PhoA</b> kann <a href="intf-view-mode.html">Bilder anzeigen</a> (im Fenster or im Vollbildmodus) und ihre Beschreibungen. Die Anzeigeparameter werden <a href="setup-view-mode.html">in den Programm-Optionen festgelegt</a>; es gibt einen Diashow-Modus, die M&ouml;glichkeit Bilder zu skalieren (vergr&ouml;&szlig;ern und verkleinern mit einer Reihe von Resampling-Filtern) sowie Panning mit <a href="intf-key-mouse-controls.html">Maus oder Tastatur</a>. Die Bilder werden in Parallelverarbeitung dekodiert, wodurch das n&auml;chste Bild w&auml;hrend der Anzeige im Hintergrund geladen werden kann. Zus&auml;tzlich besteht eine Einstellm&ouml;glichkeit, das zuletzt angezeigte Bild zwischenzuspeichern.</li>
  <li>Das Programm unterst&uuml;tzt die <a href="intf-browse-mode-tasks.html#clipboard">Zwischenablage</a>: Bilder k&ouml;nnen in die Zwischenablage kopiert oder ausgeschnitten und in eine andere Gruppe oder sogar in ein anderes Fotoalbum eingef&uuml;gt werden.</li>
  <li>Eine voll funktionsf&auml;hige <a href="intf-browse-mode-tasks.html#undo"><i>R&uuml;ckg&auml;ngig-Funktion</i></a> ist vorhanden: Jeder falsche Befehl oder auch Befehlsfolgen k&ouml;nnen r&uuml;ckg&auml;ngig gemacht werden. Die maximal m&ouml;glichen Schritte (Gr&ouml;&szlig;e des Pufferspeichers) werden in den <b>PhoA</b>-<a href="setup-browse-mode.html">Optionen</a> eingestellt.</li>
  <li>Daneben verf&uuml;gt das Programm &uuml;ber eine Reihe von Tools-Funktionen (<a href="intf-stats.html">Statistiken</a>, <a href="intf-pic-operations.html">Bildoperationen zwischen den einzelnen Gruppen</a> etc.)</li>
  <li><b>PhoA</b> schaut gut aus, reagiert immer gutartig und besitzt eine gelungene Benutzeroberfl&auml;che. Was k&ouml;nnte man dar&uuml;ber hinaus verlangen?</li>
</ul>

<p class=lsmall><u>Anmerkung</u>. Das Format der Fotoalbumdateioen (<b>.phoa</b>) kann sich w&auml;hrend der Programmentwicklung &auml;ndern. Ich werde alles daran setzen, die R&uuml;ckw&auml;rtskompatibilit&auml;t zu erhalten, d.h. k&uuml;nftige Versionen sollten die Fotoalben &auml;lterer Versionen &ouml;ffnen (und sogar speichern) k&ouml;nnen.

<p class=lsmall><a href="requirements.html">Weiter &gt;&gt;</a>

{[%hh_ftr_de]}