<!-- $Id: intf-browse-mode-tasks.html,v 1.1.1.1 2004-06-29 14:10:45 dale Exp $ -->
{[%hh_hdr_de:Arbeiten im Browser Modus]}

<p align=justify>Die wichtigsten Aufgaben werden im Kapitel <a href="intf-browse-mode-menu.html">Browser Modus Men&uuml;befehle</a> beschrieben. Im Folgenden m&ouml;chte ich auf spezifische Bereiche von <b>PhoA</b> eingehen:

{[%hh_h2:<a name=picdata>Bilddaten</a>]}
<p align=justify>Wie bereits im <a href="how-it-works.html">&Uuml;bersichtsschema</a> dargestellt wurde, speichert das Programm Bilderlisten einzeln ab (genau gesagt handelt es sich um Listen, der die Elemente der Bilddateien inkl. Beschreibung, Miniaturansichten etc. zugeordnet sind). Die Baumstruktur wird ebenso seperat gespeichert. Jede einzelne Gruppe beeinhaltet eine Reihe von Links zu den Bildern, wenn Sie also <a href="intf-pic-add.html">eine Datei einer Gruppe zuordnen</a> (da ja alle Bilder Dateien darstellen) und diese Datei bereits irgendwo im Fotoalbum angelegt und beschrieben ist, findet das Programm automatisch die dazugeh&ouml;rigen Daten. Dasselbe gilt f&uuml;r den Fall, dass Sie Bilddaten <a href="intf-pic-props.html">bearbeiten</a> (etwa den Ort oder das Datum &auml;ndern) - die Daten werden in allen dazugeh&ouml;rigen Bereichen automatisch ge&auml;ndert!
<p align=justify>Anders verh&auml;lt es sich, wenn Sie ein Bild aus einer Gruppe entfernen wollen. Ist das zu l&ouml;schende Bild noch anderen Gruppen im Fotoalbum zugeordnet, wird nur der Link zum Bild entfernt, das Bild selbst ist im Fotoalbum immer noch vorhanden (nur eben anderen Gruppen zugeordnet). Wollen Sie diese Bilddatei sp&auml;ter erneut einer Gruppe hinzuf&uuml;gen, wird <b>PhoA</b> alle verf&uuml;gbare Daten dieses Bildes der Datei automatisch zuordnen. L&ouml;schen Sie jedoch ein Bild, das nur der aktuellen Gruppe zugeordnet ist, wird die Bilddatei vollst&auml;ndig gel&ouml;scht. F&uuml;gen Sie das Bild sp&auml;ter wieder ein, m&uuml;ssen Sie die entsprechenden Daten selbst eingeben.

{[%hh_h2:<a name=dnd>Drag &amp; Drop</a>]}
<p align=justify>Nat&uuml;rlich kann ein Bild in einer Gruppe nicht zwei Mal vorhanden sein. Am einfachsten k&ouml;nnen Bilder in eine andere Gruppe kopiert werden, indem man sie mit der Maus vom rechten Fenster (dem Thumbnail-Bereich) in die entsprechende Gruppe der Baumansicht zieht und dabei die <b>Strg-Taste</b> gedr&uuml;ckt h&auml;lt. Ohne Dr&uuml;cken der <b>Strg-Taste</b> wird das Bild nicht kopiert, sondern nur verschoben (von der Ausgangsgruppe in die Zielgruppe). Es k&ouml;nnen mehrere Bilder gleichzeitig kopiert bzw. verschoben werden: Als erstes m&uuml;ssen Sie die zu kopierenden Bilder markieren (verwenden Sie dazu die <a href="intf-key-mouse-controls.html">Tastenkombination</a> <b>Strg</b>,  <b>Shift</b> und die linke Maustaste). Nehmen Sie dann ein markiertes Bild (egal welches) und ziehen Sie es hin&uuml;ber. Nachdem die Dateien verschoben oder kopiert wurden, zeigt <b>PhoA</b> in einem Dialogfenster die durchgef&uuml;hrten &Auml;nderungen an. (Dazu muss diese Funktion im Men&uuml; <a href="setup-dialogs.html">Tools | Optionen</a> Feld (<b>Dialoge | Benachrichtigungen</b>)aktiviert sein).
<p align=justify>Die Drag &amp; Drop-Funktion ist auch auf ganze Ordner anwendbar, die Baumansicht wird dadurch neu geordnet. Wenn Sie eine Gruppe in den freien Bereich rechts von den Verkn&uuml;pfungen der Baumstruktur (Knotenpunkte) ziehen, wird der Ort, an dem die Gruppe eingef&uuml;gt wird <i>Einf&uuml;geort</i> als Linie angezeigt. Die Gruppe wird an gleichrangiger Stelle wie der Zielknotenpunkt eingef&uuml;gt, &uuml;ber oder unter den Punkt, je nach dem, wohin Sie Maus bewegen (dies beeinflusst ebenfalls das Aussehen der Einf&uuml;gelinie). Ziehen Sie eine Gruppe <i>auf</i> ein andere, wird diese markiert und die Gruppe wird zu deren Untergruppe. Beachten Sie: Die Baumstruktur kann nur Fotoalbum-Ordner enthalten, andere Ordner k&ouml;nnen nicht eingef&uuml;gt werden!
<p align=justify>In &auml;hnlicher Weise k&ouml;nnen Sie Bilder kopieren (nicht jedoch verschieben), die Sie durch die Suchfunktion erhalten haben (Men&uuml; Tools | Suchen). Es ist empfehlenswert, Bilder nach Datum (z.B. nach Jahr oder nach Monat) zu sortieren, nachdem diese zuvor in einem anderen Ordner nach Thema sortiert haben (Benutzen Sie dazu die Suchfunktion um Bilder nach Datum zu suchen und kopieren Sie dann die Ergebnisse in die entsprechende Gruppe).
<p align=justify>Mit Drag &amp; Drop k&ouml;nnen Sie aber auch Bilder innerhalb einer Gruppe neu ordnen: Ziehen Sie einfach ein markiertes Thumbnail an eine andere Stelle im Thumbnail-Fenster, dabei wird die Einf&uuml;gelinie angezeigt. Wenn Sie die Maustaste loslassen, werden alle markierten Bilder an den angegebenen Ort verschoben; die Reihenfolge der Bilder wird dabei nicht ver&auml;ndert. Eine weitere Methode, Bilder neu zu ordnen, besteht darin, diese zu <a href="intf-sort-pics.html">sortieren</a>.

{[%hh_h2:<a name=clipboard>Zwischenablage</a>]}
<p align=justify><b>PhoA</b> unterst&uuml;tzt die Zwischenablage-Funktion. Zur Zeit k&ouml;nnen nur Bilder von Phoa ausgeschnitten, kopiert und eingef&uuml;gt werden. Daten, die in die Zwischenablage eingef&uuml;gt werden, bleiben vollst&auml;ndig erhalten - <i>mit Ausnahme</i> der Angabe, welcher Gruppe die Bilder zugeordnet wurden. Durch diese Funktion k&ouml;nnen Bilder in eine andere Gruppe oder auch in ein anderes Fotoalbum verschoben oder kopiert werden.
<p align=justify>Was das Einf&uuml;gen von Bildern in ein anderes Fotoalbum betrifft, gibt es jedoch gewisse Einschr&auml;nkungen: Daten von <i>bereits vorhandenen Bildern</i> (Bilder, die unter dem selben Dateinamen bereits im Fotoalbum gespeichert sind) werden nicht &uuml;berschrieben. Zum Beispiel: Sie f&uuml;gen ein Bild, das unter  C:\Fotos\Winter-Urlaub-1812.jpg gespeichert ist, in das Fotoalbum ein. Besteht dieses Bild im Fotoalbum bereits, wird das Bild nur der aktuellen Gruppe hinzugef&uuml;gt (falls es dort nicht schon ist). Ist das neu eingef&uuml;gte Bild im Zielordner bereits vorhanden, wird dieses Bild einfach &uuml;bersprungen. Nach Beendigung dieses Vorgangs benachrichtigt Sie Phoa &uuml;ber die Anzahl an Bildern, die <i>soeben</i> aus der Zwischenablage eingef&uuml;gt wurden. (Dazu muss diese Funktion im Men&uuml; <a href="setup-dialogs.html">Tools Optionen</a> Feld <b>Dialoge Benachrichtigungen</b> aktiviert sein.

{[%hh_h2:<a name=undo>R&uuml;ckg&auml;ngig-Funktion</a>]}
<p align=justify>Im Gegensatz zu vielen &auml;hnlichen Produkten, unterst&uuml;tzt <b>PhoA</b> vollst&auml;ndig die <i>R&uuml;ckg&auml;ngig-Funktion</i>. Mit Hilfe dieser Funktion kann ein im Fotoalbum vorgenommener Arbeitsschritt r&uuml;ckg&auml;ngig gemacht werden (einzige  Ausnahme bildet der Befehl <a href="intf-rebuild-thumbs.html">Thumbnails erneuern</a>) - oder aber sogar mehrere Arbeitsschritte gleichzeitig! Gehen Sie dazu auf <b>Bearbeiten | R&uuml;ckg&auml;ngig</b> bzw. <b>Bearbeiten | R&uuml;ckg&auml;ngig Verlauf</b> im Men&uuml;  <a href="intf-browse-mode-menu.html">Bearbeiten</a>. Wenn Sie einen Punkt aus der Liste R&uuml;ckg&auml;ngig-Verlauf markieren, werden alle vorhergehenden Arbeitsschritte (d.h. die, die in der Liste weiter oben sind) ebenfalls automatisch r&uuml;ckg&auml;ngig gemacht.
<p align=justify>Die Anzahl der Schritte, die r&uuml;ckg&auml;ngig gemacht werden k&ouml;nnen, wird im Men&uuml; Tools | Optionen, im Dialog <a href="setup-browse-mode.html">Browser Modus</a> angegeben. Die maximale Anzahl der Schritte, die r&uuml;ckg&auml;ngig gemacht werden k&ouml;nnen, betr&auml;gt <b>32</b>.

{[%hh_h2:<a name=view>Ansichten</a>]}
<p align=justify>Die Ansichten erm&ouml;glichen eine einzigartige Technologie zur automatischen Bildgruppierung. N&auml;here Informationen erhalten Sie unter <a href="intf-browse-mode-views.html">Arbeiten mit Ansichten</a>.

{[%hh_seealso_de]}  
  <a href="intf-key-mouse-controls.html">Tastenkombinationen und Mausbefehle</a><br>
  <a href="intf-view-mode.html">Anzeigemodus</a><br>
  <a href="intf-view-mode-tasks.html">Arbeiten im Browser Modus</a><br>

{[%hh_ftr_de]}