<!-- $Id: setup-browse-mode.html,v 1.1.1.1 2004-06-29 14:10:45 dale Exp $ -->
{[%hh_hdr_de:Optionen :: Browser Modus]}

{[%hh_h2:Thumbnail Fenster]}

  <h3>Hintergrundfarbe</h3>
  <p align=justify>Zum Bestimmen der Hintergrundfarbe des Thumbnailfensters

  <h3>Drag & Drop</h3>
  <p align=justify>Aktivieren und Deaktivieren der Drag & Drop Funktion f&uuml;r Thumbnails.

  <h3>Thumbnail Tooltips anzeigen</h3>
  <p align=justify>Diese Funktion aktiviert Pop-up Tooltips f&uuml;r Thumbnails wenn die Maus eine Zeit lang ruhig &uuml;ber einem Thumbnail gehalten wird. Diese Tooltips zeigen die Bildeigenschaften (siehe unten). Obwohl diese Funktion meistens sehr n&uuml;tzlich ist, irritiert sie manche Ben&uuml;tzer.

  <h3>In Tooltips anzeigen</h3>
  <p align=justify>Die Liste der <a href="pic-data.html">Bildeigenschaften</a>, die in den Thumbnail Tooltips angezeigt werden k&ouml;nnen.

  <h3>Auf den Thumbnails angezeigte Bilddetails</h3>
  <p align=justify>Mit Hilfe dieser Option kann ausgew&auml;hlt werden, ob und welche <a href="pic-data.html">Bildeigenschaften</a> in den verschiedenen Ecken des Thumbnails angezeigt werden sollen.

  <h3>Dicker Thumbnailrand</h3>
  <p align=justify>Bei Aktivierung werden die R&auml;nder der Thumbnails dicker.

  <h3>Thumbnails bei der Anzeige zwischenspeichern</h3>
  <p align=justify>Da Thumbnails im <a href="file-formats.html">JPEG Format</a> gespeichert werden, m&uuml;ssen sie zur Anzeige entschl&uuml;sselt werden; daher kann das Aufrufen einige Zeit in Anspruch nehmen (besonders wenn mehrere Thumbnails gleichzeitig aufgerufen werden und der PC nicht besonders schnell ist). Deshalb erm&ouml;glicht der Zwischenspeicher, die entschl&uuml;sselten Thumbnails in einem speziellen Speicher zwischenzuspeichern. (nachdem sie einmal aufgerufen wurden). Diese Funktion ben&ouml;tigt allerdings etwas mehr Speicherplatz.

  <h3>Gr&ouml;&szlig;e des Thumbnail Zwischenspeichers</h3>
  <p align=justify>Maximale Thumbnailanzahl im Zwischenspeicher

  <h3>Resampling Filter</h3>
  <p align=justify>Auswahl des Interpolierungsfilters der f&uuml;r das <a href="theory-resampling.html">Resampling</a> von Quellbildern beim Erstellen von Thumbnails verantwortlich ist.

<h3>Maximale m&ouml;gliche Schritte f&uuml;r &quot;R&uuml;ckg&auml;ngig&quot;</h3>
<p align=justify>Auswahl der Gr&ouml;&szlig;e des &quot;R&uuml;ckg&auml;ngig&quot; Speichers, der dazu dient, <a href="intf-browse-mode-tasks.html#undo">&Auml;nderungen r&uuml;ckg&auml;ngig zu machen</a> die am Fotoalbum vorgenommen wurden. Nur eine bestimmte Anzahl von aufeinanderfolgenden &Auml;nderungen kann r&uuml;ckg&auml;ngig gemacht werden (wenn der Speicher voll ist, werden die Daten der &auml;ltesten &Auml;nderungeun gel&ouml;scht). Je Gr&ouml;&szlig;er der Speicher, desto mehr Speicherplatz wird ben&ouml;tigt. (Die &Auml;nderungen, die den meisten Speicherplatz beanspruchen, sind das L&ouml;schen und Verschieben von Bildern).

{[%hh_seealso_de]}  
  <a href="setup-general.html">Optionen :: Allgemein</a><br>
  <a href="setup-view-mode.html">Optionen :: Anzeigemodus</a><br>
  <a href="setup-dialogs.html">Optionen :: Dialoge</a><br>

{[%hh_ftr_de]}